import React from "react";
import {
    ModalBody,
    ModalContainer,
    ModalHeader,
} from "../../../root/Modal";
import { Title } from "../../../root/style";
import { useLanguage } from "../../../context/LanguageContext";
import styled from "styled-components";

const InfoContainer = styled.div`
    display: flex;
    flex-direction: column;
    margin-top: 20px;

    padding: 17px 20px;
    background-color: #F7F8FC;
    border-radius: 10px;
    > div {
        color: #000;
        font-size: 32px;
        font-weight: 400;
    }
`

//generic modal error and successful

const ModalSuccessful = ({ data = { title: "Создание договора", info: "Договор упешно отправлен", status: true }, isOpen = 454, setOpen = () => { } }) => {
    const { translate } = useLanguage();



    return (
        <ModalContainer
            w={"50vw"}
            title={
                <ModalHeader>
                    <Title>{translate(data.title)}</Title>
                    <div onClick={() => setOpen(false)} className="closeIcon">
                        <svg
                            width="48"
                            height="48"
                            viewBox="0 0 48 48"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                        >
                            <path
                                opacity="0.5"
                                d="M43 24C43 34.4933 34.4933 43 24 43C13.5066 43 5 34.4933 5 24C5 13.5066 13.5066 5 24 5C34.4933 5 43 13.5066 43 24Z"
                                stroke="#808080"
                                strokeWidth="2"
                            />
                            <path
                                d="M17.9393 17.9393C18.5251 17.3536 19.4749 17.3536 20.0606 17.9393L24 21.8788L27.9394 17.9394C28.5252 17.3536 29.4748 17.3536 30.0606 17.9394C30.6464 18.5252 30.6464 19.4749 30.0606 20.0608L26.1214 24L30.0606 27.9392C30.6464 28.525 30.6464 29.4748 30.0606 30.0606C29.4748 30.6464 28.525 30.6464 27.9392 30.0606L24 26.1214L20.0608 30.0606C19.4749 30.6464 18.5252 30.6464 17.9394 30.0606C17.3536 29.4748 17.3536 28.5252 17.9394 27.9394L21.8788 24L17.9393 20.0606C17.3536 19.4749 17.3536 18.5251 17.9393 17.9393Z"
                                fill="#808080"
                            />
                        </svg>
                    </div>
                </ModalHeader>
            }
            open={isOpen}
            onOk={() => setOpen(false)}
            onCancel={() => setOpen(false)}
            footer={[]}
            centered
        >
            <InfoContainer>
                {
                    data?.status ? <div>
                        <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path opacity="0.5" d="M6.92894 41.071C9.85786 44 14.5719 44 24 44C33.428 44 38.1422 44 41.071 41.071C44 38.1422 44 33.428 44 24C44 14.5719 44 9.85786 41.071 6.92894C38.1422 4 33.428 4 24 4C14.5719 4 9.85786 4 6.92894 6.92894C4 9.85786 4 14.5719 4 24C4 33.428 4 38.1422 6.92894 41.071Z" fill="#1FC16B" />
                            <path d="M37.162 18.9486C37.686 18.3069 37.5904 17.362 36.9486 16.8381C36.3068 16.3142 35.362 16.4097 34.838 17.0515L24.5028 29.7118C24.077 29.5606 23.5878 29.6028 23.1802 29.869C22.4864 30.3218 22.2912 31.2512 22.744 31.9448L23.315 32.8198C23.5766 33.2206 24.0136 33.4724 24.4914 33.498C24.9692 33.5234 25.4306 33.3194 25.7332 32.9486L37.162 18.9486Z" fill="#1FC16B" />
                            <path d="M29.162 18.9486C29.686 18.3069 29.5904 17.3619 28.9486 16.8381C28.3068 16.3142 27.362 16.4097 26.838 17.0515L16.5715 29.628L13.162 25.4514C12.6382 24.8098 11.6932 24.7142 11.0515 25.238C10.4097 25.762 10.3142 26.7068 10.8381 27.3486L15.4095 32.9486C15.6944 33.2976 16.121 33.5 16.5715 33.5C17.022 33.5 17.4486 33.2976 17.7335 32.9486L29.162 18.9486Z" fill="#1FC16B" />
                        </svg>

                    </div> : <div>
                        <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path opacity="0.5" d="M24 44C14.5719 44 9.85786 44 6.92894 41.071C4 38.1422 4 33.428 4 24C4 14.5719 4 9.85786 6.92894 6.92894C9.85786 4 14.5719 4 24 4C33.428 4 38.1422 4 41.071 6.92894C44 9.85786 44 14.5719 44 24C44 33.428 44 38.1422 41.071 41.071C38.1422 44 33.428 44 24 44Z" fill="#FB3748" />
                            <path d="M17.9393 17.9393C18.5251 17.3536 19.4749 17.3536 20.0606 17.9393L24 21.8788L27.9394 17.9394C28.5252 17.3536 29.4748 17.3536 30.0606 17.9394C30.6464 18.5252 30.6464 19.4749 30.0606 20.0606L26.1214 24L30.0606 27.9394C30.6464 28.525 30.6464 29.4748 30.0606 30.0606C29.4748 30.6464 28.525 30.6464 27.9392 30.0606L24 26.1214L20.0608 30.0606C19.4749 30.6464 18.5252 30.6464 17.9394 30.0606C17.3536 29.4748 17.3536 28.5252 17.9394 27.9394L21.8788 24L17.9393 20.0606C17.3536 19.4749 17.3536 18.5251 17.9393 17.9393Z" fill="#FB3748" />
                        </svg>

                    </div>
                }
                <div>
                    {data.info}
                </div>
            </InfoContainer>
            <ModalBody>

            </ModalBody>
        </ModalContainer>
    );
};

export default ModalSuccessful;
