import React, { useState } from "react";
import { Main, Wrap, Items, Item, Card, Btn, } from './Style'
import styled from "styled-components";
import { Modal } from "antd";
import { useLanguage } from "../../../context/LanguageContext";
import { ModalHeader, ModalContainer } from "../../../root/Modal";
import { Title } from "../../../root/style";
import CloseIcon from "../../../assets/svg/closeIcon";
export const modal1Data =
{
  doctorName: "Евгений Александрович Усачев",
  workplace: "Ташкент, Салар, MClinic",
  registrationDate: "12.11.2021",
  contact: "+998 (97) 123 12 21",
  condition: "СУ",
  period: "С 29/11/2024 по 02/12/2024",
  goal: "Шаг",
  km: `1.740.000`,
};

const StyledModal = styled(Modal)`
  .ant-modal-content {
    border-radius: 16px;
    padding: 24px;
    width: 900px;
  }
`;

const Modal1 = ({ isOpen, onClose }) => {
  const [packages, setPackages] = useState([
    { name: "Алтикам", amount: 100 },
    { name: "Ампилин", amount: 0 },
    { name: "Артокол мазь", amount: 23 },
    { name: "Артокол уколы", amount: 200 },
  ]);

  const [editingPackage, setEditingPackage] = useState(null);
  const [newAmount, setNewAmount] = useState("");
  const [isLoading, setIsLoading] = useState(0);


  const handleDelete = (index) => {
    setPackages(packages.filter((_, i) => i !== index));
  };

  const handleEdit = (index) => {
    setEditingPackage(index);
    setNewAmount(packages[index].amount);
  };

  const handleSaveEdit = () => {
    const updatedPackages = [...packages];
    updatedPackages[editingPackage].amount = newAmount;
    setPackages(updatedPackages);
    setEditingPackage(null);
    setNewAmount("");
  };
  const { translate } = useLanguage();

  console.log(isOpen, onClose, "oooooooooooopen");

  return (
    <ModalContainer
      title={
        <ModalHeader>
          <Title size={"48px"}>{translate("Договор")} №119</Title>
          <div onClick={() => onClose(false)} className="closeIcon">
            <CloseIcon />
          </div>
        </ModalHeader>
      }
      open={isOpen}
      onOk={() => onClose(false)}
      onCancel={() => onClose(false)}
      footer={[]}
      centered
    >
      {isLoading ? (<div className="loaderParent">
        <div className="loader"></div>
      </div>) : ""}
      <Main>
        <Wrap>
          <Title size="24px">{translate("Выбранные препараты")}</Title>
          <Items>
            <Item>
              <p>Алтикам</p>
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
                  <path d="M12.5 22C18.0228 22 22.5 17.5228 22.5 12C22.5 6.47715 18.0228 2 12.5 2C6.97715 2 2.5 6.47715 2.5 12C2.5 17.5228 6.97715 22 12.5 22Z" stroke="black" stroke-width="1.5" />
                  <path d="M15 9.50002L10 14.5M10 9.5L15 14.5" stroke="black" stroke-width="1.5" stroke-linecap="round" />
                </svg>
              </div>
            </Item>
            <Item>
              <p>Ампилин</p>
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
                  <path d="M12.5 22C18.0228 22 22.5 17.5228 22.5 12C22.5 6.47715 18.0228 2 12.5 2C6.97715 2 2.5 6.47715 2.5 12C2.5 17.5228 6.97715 22 12.5 22Z" stroke="black" stroke-width="1.5" />
                  <path d="M15 9.50002L10 14.5M10 9.5L15 14.5" stroke="black" stroke-width="1.5" stroke-linecap="round" />
                </svg>
              </div>
            </Item>
            <Item>
              <p>Артокол мазь</p>
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
                  <path d="M12.5 22C18.0228 22 22.5 17.5228 22.5 12C22.5 6.47715 18.0228 2 12.5 2C6.97715 2 2.5 6.47715 2.5 12C2.5 17.5228 6.97715 22 12.5 22Z" stroke="black" stroke-width="1.5" />
                  <path d="M15 9.50002L10 14.5M10 9.5L15 14.5" stroke="black" stroke-width="1.5" stroke-linecap="round" />
                </svg>
              </div>
            </Item>
            <Item>
              <p>Артокол уколы</p>
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
                  <path d="M12.5 22C18.0228 22 22.5 17.5228 22.5 12C22.5 6.47715 18.0228 2 12.5 2C6.97715 2 2.5 6.47715 2.5 12C2.5 17.5228 6.97715 22 12.5 22Z" stroke="black" stroke-width="1.5" />
                  <path d="M15 9.50002L10 14.5M10 9.5L15 14.5" stroke="black" stroke-width="1.5" stroke-linecap="round" />
                </svg>
              </div>
            </Item>
          </Items>
        </Wrap>
        <Wrap>
          <Title size="24px">{translate("Условия")}</Title>

          <Items>
            <Card>
              <div>
                <Title size="16px">{"<"} = 60% {translate("квота")}</Title>
                <div className="text">11%</div>
              </div>
              <article>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                  <path opacity="0.5" d="M20.8487 8.71306C22.3844 7.17735 22.3844 4.68748 20.8487 3.15178C19.313 1.61607 16.8231 1.61607 15.2874 3.15178L14.4004 4.03882C14.4125 4.0755 14.4251 4.11268 14.4382 4.15035C14.7633 5.0875 15.3768 6.31601 16.5308 7.47002C17.6848 8.62403 18.9133 9.23749 19.8505 9.56262C19.888 9.57563 19.925 9.58817 19.9615 9.60026L20.8487 8.71306Z" fill="#216BF4" />
                  <path d="M14.4386 4L14.4004 4.03819C14.4125 4.07487 14.4251 4.11206 14.4382 4.14973C14.7633 5.08687 15.3768 6.31538 16.5308 7.4694C17.6848 8.62341 18.9133 9.23686 19.8505 9.56199C19.8876 9.57489 19.9243 9.58733 19.9606 9.59933L11.4001 18.1598C10.823 18.7369 10.5343 19.0255 10.2162 19.2737C9.84082 19.5665 9.43469 19.8175 9.00498 20.0223C8.6407 20.1959 8.25351 20.3249 7.47918 20.583L3.39584 21.9442C3.01478 22.0712 2.59466 21.972 2.31063 21.688C2.0266 21.4039 1.92743 20.9838 2.05445 20.6028L3.41556 16.5194C3.67368 15.7451 3.80273 15.3579 3.97634 14.9936C4.18114 14.5639 4.43213 14.1578 4.7249 13.7824C4.97307 13.4643 5.26165 13.1757 5.83874 12.5986L14.4386 4Z" fill="#216BF4" />
                </svg>
              </article>
            </Card>
            <Card>
              <div>
                <Title size="16px">75-90% {translate("квота")}</Title>
                <div className="text">11%</div>
              </div>
              <article>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                  <path opacity="0.5" d="M20.8487 8.71306C22.3844 7.17735 22.3844 4.68748 20.8487 3.15178C19.313 1.61607 16.8231 1.61607 15.2874 3.15178L14.4004 4.03882C14.4125 4.0755 14.4251 4.11268 14.4382 4.15035C14.7633 5.0875 15.3768 6.31601 16.5308 7.47002C17.6848 8.62403 18.9133 9.23749 19.8505 9.56262C19.888 9.57563 19.925 9.58817 19.9615 9.60026L20.8487 8.71306Z" fill="#216BF4" />
                  <path d="M14.4386 4L14.4004 4.03819C14.4125 4.07487 14.4251 4.11206 14.4382 4.14973C14.7633 5.08687 15.3768 6.31538 16.5308 7.4694C17.6848 8.62341 18.9133 9.23686 19.8505 9.56199C19.8876 9.57489 19.9243 9.58733 19.9606 9.59933L11.4001 18.1598C10.823 18.7369 10.5343 19.0255 10.2162 19.2737C9.84082 19.5665 9.43469 19.8175 9.00498 20.0223C8.6407 20.1959 8.25351 20.3249 7.47918 20.583L3.39584 21.9442C3.01478 22.0712 2.59466 21.972 2.31063 21.688C2.0266 21.4039 1.92743 20.9838 2.05445 20.6028L3.41556 16.5194C3.67368 15.7451 3.80273 15.3579 3.97634 14.9936C4.18114 14.5639 4.43213 14.1578 4.7249 13.7824C4.97307 13.4643 5.26165 13.1757 5.83874 12.5986L14.4386 4Z" fill="#216BF4" />
                </svg>
              </article>
            </Card>

          </Items>
          <Items>
            <Card>
              <div>
                <Title size="16px">{translate("Спецусловия")} ({translate("лимит")})</Title>
                <div className="text">30%</div>
              </div>
              <article>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                  <path opacity="0.5" d="M20.8487 8.71306C22.3844 7.17735 22.3844 4.68748 20.8487 3.15178C19.313 1.61607 16.8231 1.61607 15.2874 3.15178L14.4004 4.03882C14.4125 4.0755 14.4251 4.11268 14.4382 4.15035C14.7633 5.0875 15.3768 6.31601 16.5308 7.47002C17.6848 8.62403 18.9133 9.23749 19.8505 9.56262C19.888 9.57563 19.925 9.58817 19.9615 9.60026L20.8487 8.71306Z" fill="#216BF4" />
                  <path d="M14.4386 4L14.4004 4.03819C14.4125 4.07487 14.4251 4.11206 14.4382 4.14973C14.7633 5.08687 15.3768 6.31538 16.5308 7.4694C17.6848 8.62341 18.9133 9.23686 19.8505 9.56199C19.8876 9.57489 19.9243 9.58733 19.9606 9.59933L11.4001 18.1598C10.823 18.7369 10.5343 19.0255 10.2162 19.2737C9.84082 19.5665 9.43469 19.8175 9.00498 20.0223C8.6407 20.1959 8.25351 20.3249 7.47918 20.583L3.39584 21.9442C3.01478 22.0712 2.59466 21.972 2.31063 21.688C2.0266 21.4039 1.92743 20.9838 2.05445 20.6028L3.41556 16.5194C3.67368 15.7451 3.80273 15.3579 3.97634 14.9936C4.18114 14.5639 4.43213 14.1578 4.7249 13.7824C4.97307 13.4643 5.26165 13.1757 5.83874 12.5986L14.4386 4Z" fill="#216BF4" />
                </svg>
              </article>
            </Card>
            <Card>
              <div>
                <Title size="16px">{translate("Спецбал")} ({translate("лимит")})</Title>
                <div className="text">20%</div>
              </div>
              <article>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                  <path opacity="0.5" d="M20.8487 8.71306C22.3844 7.17735 22.3844 4.68748 20.8487 3.15178C19.313 1.61607 16.8231 1.61607 15.2874 3.15178L14.4004 4.03882C14.4125 4.0755 14.4251 4.11268 14.4382 4.15035C14.7633 5.0875 15.3768 6.31601 16.5308 7.47002C17.6848 8.62403 18.9133 9.23749 19.8505 9.56262C19.888 9.57563 19.925 9.58817 19.9615 9.60026L20.8487 8.71306Z" fill="#216BF4" />
                  <path d="M14.4386 4L14.4004 4.03819C14.4125 4.07487 14.4251 4.11206 14.4382 4.14973C14.7633 5.08687 15.3768 6.31538 16.5308 7.4694C17.6848 8.62341 18.9133 9.23686 19.8505 9.56199C19.8876 9.57489 19.9243 9.58733 19.9606 9.59933L11.4001 18.1598C10.823 18.7369 10.5343 19.0255 10.2162 19.2737C9.84082 19.5665 9.43469 19.8175 9.00498 20.0223C8.6407 20.1959 8.25351 20.3249 7.47918 20.583L3.39584 21.9442C3.01478 22.0712 2.59466 21.972 2.31063 21.688C2.0266 21.4039 1.92743 20.9838 2.05445 20.6028L3.41556 16.5194C3.67368 15.7451 3.80273 15.3579 3.97634 14.9936C4.18114 14.5639 4.43213 14.1578 4.7249 13.7824C4.97307 13.4643 5.26165 13.1757 5.83874 12.5986L14.4386 4Z" fill="#216BF4" />
                </svg>
              </article>
            </Card>

          </Items>
          <Items>
            <Card>
              <div>
                <Title size="16px">{translate("Госзакуп")} ({translate("лимит")})</Title>
                <div className="text">30%</div>
              </div>
              <article>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                  <path opacity="0.5" d="M20.8487 8.71306C22.3844 7.17735 22.3844 4.68748 20.8487 3.15178C19.313 1.61607 16.8231 1.61607 15.2874 3.15178L14.4004 4.03882C14.4125 4.0755 14.4251 4.11268 14.4382 4.15035C14.7633 5.0875 15.3768 6.31601 16.5308 7.47002C17.6848 8.62403 18.9133 9.23749 19.8505 9.56262C19.888 9.57563 19.925 9.58817 19.9615 9.60026L20.8487 8.71306Z" fill="#216BF4" />
                  <path d="M14.4386 4L14.4004 4.03819C14.4125 4.07487 14.4251 4.11206 14.4382 4.14973C14.7633 5.08687 15.3768 6.31538 16.5308 7.4694C17.6848 8.62341 18.9133 9.23686 19.8505 9.56199C19.8876 9.57489 19.9243 9.58733 19.9606 9.59933L11.4001 18.1598C10.823 18.7369 10.5343 19.0255 10.2162 19.2737C9.84082 19.5665 9.43469 19.8175 9.00498 20.0223C8.6407 20.1959 8.25351 20.3249 7.47918 20.583L3.39584 21.9442C3.01478 22.0712 2.59466 21.972 2.31063 21.688C2.0266 21.4039 1.92743 20.9838 2.05445 20.6028L3.41556 16.5194C3.67368 15.7451 3.80273 15.3579 3.97634 14.9936C4.18114 14.5639 4.43213 14.1578 4.7249 13.7824C4.97307 13.4643 5.26165 13.1757 5.83874 12.5986L14.4386 4Z" fill="#216BF4" />
                </svg>
              </article>
            </Card>
            <Card>
              <div>
                <Title size="16px"> {translate("Кабинет вакцинации")}</Title>
                <div className="text">30%</div>
              </div>
              <article>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                  <path opacity="0.5" d="M20.8487 8.71306C22.3844 7.17735 22.3844 4.68748 20.8487 3.15178C19.313 1.61607 16.8231 1.61607 15.2874 3.15178L14.4004 4.03882C14.4125 4.0755 14.4251 4.11268 14.4382 4.15035C14.7633 5.0875 15.3768 6.31601 16.5308 7.47002C17.6848 8.62403 18.9133 9.23749 19.8505 9.56262C19.888 9.57563 19.925 9.58817 19.9615 9.60026L20.8487 8.71306Z" fill="#216BF4" />
                  <path d="M14.4386 4L14.4004 4.03819C14.4125 4.07487 14.4251 4.11206 14.4382 4.14973C14.7633 5.08687 15.3768 6.31538 16.5308 7.4694C17.6848 8.62341 18.9133 9.23686 19.8505 9.56199C19.8876 9.57489 19.9243 9.58733 19.9606 9.59933L11.4001 18.1598C10.823 18.7369 10.5343 19.0255 10.2162 19.2737C9.84082 19.5665 9.43469 19.8175 9.00498 20.0223C8.6407 20.1959 8.25351 20.3249 7.47918 20.583L3.39584 21.9442C3.01478 22.0712 2.59466 21.972 2.31063 21.688C2.0266 21.4039 1.92743 20.9838 2.05445 20.6028L3.41556 16.5194C3.67368 15.7451 3.80273 15.3579 3.97634 14.9936C4.18114 14.5639 4.43213 14.1578 4.7249 13.7824C4.97307 13.4643 5.26165 13.1757 5.83874 12.5986L14.4386 4Z" fill="#216BF4" />
                </svg>
              </article>
            </Card>

          </Items>
        </Wrap>
        <Items>
          <Btn>
            Сохранить изменения в шаблоне
          </Btn>
          <Btn send={true}>
            Использовать шаблон
          </Btn>
        </Items>
      </Main>
    </ModalContainer >
  );
};

export default Modal1;
